# Taps
tap "hashicorp/tap"
tap "oven-sh/bun"
tap "witco/witco", "https://github.com/witco-oss/homebrew-witco.git"

# CLI Tools
brew "awscli"
brew "abyss/tools/awsp"
brew "bat"
brew "oven-sh/bun/bun"
brew "direnv"
brew "docker"
brew "dockutil"
brew "defaultbrowser"
brew "fish"
brew "fnm"
brew "git" # Easier to update git with homebrew
brew "gh"
# Kubernetes tools handled by witco-cli
# brew "kubectl"
# brew "k9s"
# brew "kubectx"
brew "make"
brew "htop"
brew "jq"
brew "lazygit"
brew "lf"
brew "tokei"
brew "hashicorp/tap/vault"
brew "wget"
brew "witco-cli"
brew "zoxide"

# Casks (GUI Applications)
cask "helium"
cask "orbstack"
cask "visual-studio-code"
