# VSCode Extensions to install manually
# Run: code --install-extension <extension-id>

esbenp.prettier-vscode
mechatroner.rainbow-csv
oderwat.indent-rainbow
pkief.material-icon-theme
ritwickdey.liveserver
stylelint.vscode-stylelint
yoavbls.pretty-ts-errors
anthropic.claude-code
cweijan.vscode-database-client2
sst-dev.opencode
